run/tutorials/multiphase/interCondEvapPhaseChangeFoam/NimaSamStefanLeeEvap/0/PHI0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      PHI0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 -1 0 0 0 0];

internalField   uniform 0;  

boundaryField
{
	
	rightWall
    {
        type            zeroGradient;
    }
	leftWall
    {
        type            zeroGradient;
    }
	
	topBottom
    {
        type            empty;
    }
	frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
